ExchangePlans/ОбменОбучение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ExchangePlan>
		<Properties>
			<Name>ОбменОбучение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Service_CloudFirestoreAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Service_IdentityToolkitAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Web_API_Key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменОбучение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция НайтиУзелОбмена(КодУзла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменОбучение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменОбучение КАК ОбменОбучение
		|ГДЕ
		|	ОбменОбучение.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Возврат ПланыОбмена.ОбменОбучение.ПустаяСсылка();
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции



Функция НастройкиУзла(КодУзла)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура("Service_CloudFirestoreAPI, Service_IdentityToolkitAPI, Project_ID, Web_API_Key, UserUID");
	УзелОбмена = НайтиУзелОбмена(КодУзла);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменОбучение.Service_CloudFirestoreAPI КАК Service_CloudFirestoreAPI,
		|	ОбменОбучение.Service_IdentityToolkitAPI КАК Service_IdentityToolkitAPI,
		|	ОбменОбучение.Project_ID КАК Project_ID,
		|	ОбменОбучение.Web_API_Key КАК Web_API_Key,
		|	ОбменОбучение.UserUID КАК UserUID
		|ИЗ
		|	ПланОбмена.ОбменОбучение КАК ОбменОбучение
		|ГДЕ
		|	ОбменОбучение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроек,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

	
	
	
#КонецЕсли
